Revit 2024 API
BuiltInFailures.MEPFabricationFailures.NoStructuralHostToAttachWarning Property
 There is no structural component to attach the hanger rod to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoStructuralHostToAttachWarning { get; }
Visual Basic
Public Shared ReadOnly Property NoStructuralHostToAttachWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoStructuralHostToAttachWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace